Repository: skoufas/skoufas-library
Catalog: books/locale/*/LC_MESSAGES/django.po
Languages: el

source: books
el: Βιβλία

source: ISBN-10 or ISBN-13
el: ISBN-10 ή ISBN-13

source: Dewey format XXX, XXX ABC, XXX.XXX, XXX.XXX ABC
el: Αριθμός Dewey NNN, ΝΝΝ ΑΒΓ, ΝΝΝ.ΝΝΝ, ΝΝΝ.ΝΝΝ ΑΒΓ

source: Dewey
el: Ταξινομικός Αριθμός Dewey

source: first name
el: Όνομα

source: middle name
el: Μεσαίο Όνομα

source: surname
el: Επίθετο

source: organisation name
el: Οργάνωση

source: Nameless author
el: Συγγραφέας χωρίς όνομα

source: Author
el: Συγγραφέας

source: Authors
el: Συγγραφείς

source: Nameless translator
el: Μεταφραστής χωρίς όνομα

source: Translator
el: Μεταφραστής

source: Translators
el: Μεταφραστές

source: Nameless curator
el: Επιμελητής χωρίς όνομα

source: Curator
el: Επιμελητής

source: Curators
el: Επιμελητές

source: Nameless donor
el: Δωρητής χωρίς όνομα

source: Donor
el: Δωρητής

source: Donors
el: Δωρητές

source: Editor
el: Εκδότης

source: Editor place
el: Τόπος Έκδοσης

source: Nameless editor
el: Εκδότης χωρίς όνομα

source: Unknown editor in {}
el: Άγνωστος εκδότης απο {}

source: Editors
el: Εκδότες

source: topic
el: Θέμα

source: Topic
el: Θέμα

source: Topics
el: Θέματα

source: editor
el: Εκδότης

source: Title
el: Τίτλος

source: Subtitle
el: Υπότιτλος

source: Language
el: Γλώσσα

source: Edition
el: Εκδότης

source: Edition Year
el: Έτος έκδοσης

source: Pages
el: Σελίδες

source: Copies
el: Αντίτυπα

source: Volumes
el: Τεύχη/Τόμοι

source: Notes
el: Σημειώσεις

source: Material
el: Υλικό

source: Offprint
el: Ανάτυπο

source: Has CD
el: Έχει CD

source: Has DVD
el: Έχει DVD

source: Book with no title and subtitle
el: Βιβλίο χωρίς τιτλο και υπότιτλο

source: Book Entry
el: Κάρτα Βιβλίου

source: Book Entries
el: Κάρτες Βιβλίου

source: Entry number
el: Αριθμός εισαγωγής

source: Entry Number
el: Αριθμός εισαγωγής

source: Entry Numbers
el: Αριθμοί εισαγωγής

source: DBF Sequence
el: Οθόνες DBF

source: Import Time
el: Ώρα εισαγωγής

source: DBF entry
el: Οθόνη DBF

source: DBF entries
el: Οθόνες DBF

source: Code
el: Κωδικός

source: Value
el: Τιμή

source: DBF row
el: Πεδίο DBF

source: DBF rows
el: Πεδία DBF

source: About the Skoufas Library
el: Βιβλιοθήκη Σκουφά: Πληροφορίες

source: One of the first achievements of the Skoufas Association since its foundation in April 1896 was establishing a library in Arta. In July 1896, letters were sent to the University of Athens, to the "PARNASSOS" Association and to all the people of Arta who wanted to donate books. The first donations were made and the foundations were laid for the establishment of the Library. In the years that followed, efforts were made to enrich the Library, with old and new publications. Many of our fellow citizens, named and anonymous, have donated books ever since.
el: Ένα από τα πρώτα επιτεύγματα του Συλλόγου Σκουφάς ήδη από την ιδρυση του τον Απρίλιο του 1896 ήταν η συγκρότηση Βιβλιοθήκης στην Άρτα. Τον Ιούλιο του 1896 εστάλησαν επιστολές στο Πανεπιστήμιο Αθηνών, στο Σύλλογο «ΠΑΡΝΑΣΣΟΣ» και σε όλους τους Αρτινούς που ήθελαν να δωρίσουν βιβλία. Έγιναν οι πρώτες δωρεές και μπήκαν τα θεμέλια για την ίδρυση της Βιβλιοθήκης. Στα χρόνια που ακολούθησαν έγιναν προσπάθειες για εμπλουτισμό της Βιβλιοθήκης, με παλιές και νέες εκδόσεις. Πολλοί συμπολίτες μας έκτοτε, επώνυμοι και ανώνυμοι, χάρισαν βιβλία.

source: The first donations to the Library came from the members of the first Board of Directors, Theod. Thomopoulos, the Association "PARNASSOS", the Association "MIKROS OMILOS" (after its dissolution in 1927 its library was offered to the Association), the lawyer K. Anagnostopoulos (in 1962 he donated to the Library a large series of legal books in Greek and foreign languages), the Society of Continental Studies, the Eugenides Foundation and Emporiki Bank. Eumorfia Kotzioula, Haril. Bletsos and Michalis Peranthis also offered books. The library of the poet Kostas Krystallis enriched our shelves. A major donor to the Library is Petros Garoufalias, who donated a large number of books in foreign languages and in Greek. Furthermore, Ioannis Papavasiliou donated a remarkable series of books of great intellectual value.
el: Οι πρώτες δωρεές προς την Βιβλιοθήκη προέρχονται από τα μέλη του πρώτου Διοικητικού Συμβουλίου, τον Θεοδ. Θωμόπουλο, το Σύλλογο «ΠΑΡΝΑΣΣΟΣ», το Σωματείο «ΜΙΚΡΟΣ ΟΜΙΛΟΣ» (μετά τη διάλυσή του το 1927 πρόσφερε τη βιβλιοθήκη του στο Σύλλογο), το δικηγόρο Κ. Αναγνωστόπουλο ( το 1962 δώρισε στη Βιβλιοθήκη μια μεγάλη σειρά νομικών βιβλίων στην ελληνική και σε ξένες γλώσσες), την Εταιρεία Ηπειρωτικών Μελετών, το Ευγενίδειο Ίδρυμα και την Εμπορική Τράπεζα. Προσφορές έγιναν απο την Ευμορφία Κοτζιούλα, Χαρίλ. Μπλέτσο και Μιχάλη Περάνθη, ενώ στη βιβλιοθήκη περιήλθε και εκείνη του ποιητή Κώστα Κρυστάλλη. Μεγάλος δωρητής της Βιβλιοθήκης θεωρείται ο Πέτρος Γαρουφαλιάς, που πρόσφερε ένα μεγάλο αριθμό βιβλίων ξενόγλωσσων και ελληνικών. Ακόμη, ο Ιωάννης Παπαβασιλείου δώρισε μια αξιόλογη σειρά βιβλίων μεγάλης πνευματικής αξίας.

source: Among the major donors are the family of Giannis Banias, who donated 1,451 book titles to the Library from his personal library, Mr. Dimitris Tomboulidis, who has so far donated over 2,000 book titles for the Pontic and Asia Minor Hellenism department along with archival material, Mr. Kon/nos Tsiligiannis, who gave the Association his personal Library and photographic material, as well as the family Dim. Portovara. Various authors also sent poems, short stories or whatever they had published. The Ministry of Education has also provided a large number of valuable publications.
el: Στους μεγάλους δωρητές συγκαταλέγονται η οικογένεια του Γιάννη Μπανιά, που δώρισε στη Βιβλιοθήκη 1.451 τίτλους βιβλίων από την προσωπική βιβλιοθήκη του Γιάννη, ο κ. Δημήτρης Τομπουλίδης , που μέχρι στιγμής πρόσφερε πάνω από 2.000 τίτλους βιβλίων για το τμήμα του Ποντιακού και Μικρασιάτικου Ελληνισμού καθώς και δωρεές υλικού για την αρχειοθέτηση, ο Κων/νος Τσιλιγιάννης, που παραχώρησε στο Σύλλογο την προσωπική του Βιβλιοθήκη και φωτογραφικό υλικό, καθώς και η οικογένεια Δημ. Πορτοβάρα. Διάφοροι συγγραφείς έστειλαν και αυτοί ποιήματα, διηγήματα ή ό,τι είχαν εκδώσει. Το Υπουργείο Παιδείας με απόφασή του έστειλε ένα μεγάλο αριθμό πολύτιμων εκδόσεων.

source: In 1991 the Board of Directors of the "SKOUFAS" Association hired a graduate Librarian in order to properly organize the Library. In 1992, the Library was moved to the ground floor of Garoufalia's house, on Apokaykou Street 1, which belongs to the ELEI of Arta. In the same year, a small reading room was created and the organization of the Library begins according to international standards. More than 30.000 books have since been catalogued using a Dewey variant in the Library's legacy database.
el: Το 1991, το Δ.Σ. του Συλλόγου «ΣΚΟΥΦΑΣ» προσέλαβε πτυχιούχο Βιβλιοθηκονομίας με σκοπό την ορθή οργάνωση της Βιβλιοθήκης. Το 1992, η Βιβλιοθήκη μεταφέρθηκε στο ισόγειο της οικίας του Γαρουφαλιά , επί της οδού Αποκαύκου 1, που ανήκει στα ΕΛΕΗ Άρτας. Την ίδια χρονιά δημιουργείται μικρό αναγνωστήριο και αρχίζει η οργάνωση της Βιβλιοθήκης σύμφωνα με διεθνή πρότυπα. Πάνω απο 30.000 βιβλία έχουν καταλογραφηθεί με σύστημα Dewey σε βάση δεδομένων παλαιού τύπου.

source: In 2019, a volunteer effort was started to modernise its ageing cataloguing system. The legacy DBF database was reverse engineered and a long effort to clear the results of years of labor from inconsistencies caused by the limitations of the format was started. That work can be tracked in the <a href="https://github.com/skoufas/skoufas-dbf-reader">skoufas-dbf-reader</a> GitHub project. In 2022, a second volunteed project was started to allow the personnel of the libary to make use of more modern technologies, as a stepping stone towards a full-fledged electronic libary solution. The code for that project, the website you're reading now, can be found in the <a href="https://github.com/skoufas/skoufas-library">skoufas-library</a> GitHub project.
el: Το 2019, άρχισε εθελοντική προσπάθεια εκμοντερνισμού του συστήματος καταλογογράφησης. Έγινε αποκωδικοποίηση της βάσης δεδομένων απο μορφή DBF και άρχισε μια μακρά προσπάθεια καθαρισμού της βάσης απο ασυνέπειες που οφείλονταν σε περιορισμούς του αρχικού προγράμματος. Ο κώδικας και η εξέλιξη αυτής της προσπάθειας είναι διαθέσιμοι στο <a href="https://github.com/skoufas/skoufas-dbf-reader">skoufas-dbf-reader</a>. Το 2022 άρχισε δέυτερο εθελοντικό έργο για να επιτρέψει στο προσωπικό της βιβλιοθήκης να χρησιμοποιήσει σύγχρονες τεχνολογίες, ενα βήμα στην εξέλιξη της βιβλιοθήκης με απότερο σκοπό τη χρήση μιας πλήρης βιβλιοθηκονομικής εφαρμογής. Ο κώδικας για αυτό το έργο, ο ιστότοπος που διαβάζετε τώρα, είναι ανοιχτός και διαθέσιμος στο GitHub project <a href="https://github.com/skoufas/skoufas-library">skoufas-library</a>.

source: We welcome feedback and volunteer contributions to the code! Please email rockdreamer at gmail dot com for more information.
el: Σας προτρύνουμε να στείλετε σχόλια και να βοηθήσετε στην εξέλιξη του κώδικα! Παρακαλώ στείλτε μύνημα στο rockdreamer παπάκι gmail τελεία com για περισσότερες πληροφορίες.

source: Currently the Library operates a lending service for most of its books, except for rare books and manuscripts. Access to the latter must be agreed and coordinated beforehand. Please contact us for more information. It is enrolled in the ATLAS program of the Universities of Greece and DASTA for the TEI. Its <a href="https://www.loc.gov/marc/organizations/org-search.php">MARC Org Code</a> is GR-ArMPA (Id 43410).
el: Η Βιβλιοθήκη λειτουργεί ως δανειστική για το μεγαλύτερο μέρος των βιβλίων της , εκτός των σπάνιων βιβλίων και των χειρογράφων. Πρόσβαση στα σπάνια βιβλία γίνεται κατόπιν συνεννόησης. Παρακαλώ επικοινωνήστε μαζί μας για περεταίρω πληροφορίες. Είναι εγγεγραμμένη στο πρόγραμμα ΑΤΛΑΣ των Πανεπιστημίων της Ελλάδας και DASTA για το ΤΕΙ. Ο <a href="https://www.loc.gov/marc/organizations/org-search.php">κωδικός οργάνωσης MARC</a> είναι GR-ArMPA (Id 43410).

source: Some of the rare publications available in the Library of the SKOUFAS Association are: <ul> <li>History of Macedonian Hellenism – Droysen – 1899</li> <li>Apanda Solomos – Sakellarios – 1901</li> <li>Apanda Loucianos – Fexis – 1911</li> <li>Lectures of Greek Poets - Estia - 1925</li> <li>Legal Philosophies – H. Anastasiadou – 1927</li> <li>Continental Glossary (Aravantinou) – Petrakou – 1909</li> <li>Eastern Thrace – Netr Vei – 1927</li> <li>Wedding in Crete (Pavlos Vlastou) – 1893</li> <li>The Holy City of Jerusalem (Beniamin Ioannidou) – 1877</li> <li>Biographical Notes (Claudio Badaloukas) – 1876</li> <li>General Introduction to Christian Archeology (G. Lampaki) – 1897</li> <li>On Doubt –SherwoodEddy– 1920</li> <li>Reflections on the Municipal Song (Alki Thrylou) – Kallergi – 1928</li> <li>Enochikon Dikaion (E.Dernburg) – Fexi – 1909</li> <li>Psychology (Dim. Moraitou) – 1926</li> <li>Handbook of Empirical Psychology (Gust. Ed. Linder) – Korinnis – 1884</li> <li>The Age of Renaissance (W.Pater) – Vassiliou – 1923</li> <li>The drama of Lefktra (Theoch. Tsoutsinos) – Hatziioannou – 1924</li> <li>The Protomaster (Kalomoiri) – Panathinaeon – 1910</li> <li>Biography of Heroes: M. Botsaris-G. Karaiskakis (Georgios Gazis) – 1828</li> <li>Maximus the Greek – Papamichael – 1920</li> <li>Ignatius Metropolitan of Hungary-Wallachia (1766-1828) – Cantor – 1919</li> <li>The Agrarian Question in Epirus (Georgiou Pachy) – 1882</li> <li>Turkish-occupied Greece – Sathas – 1869</li> <li>Historical Dissertations – Sathas – 1870</li> <li>Friendly Society (I. Philimonos) – Koltoura – 1834</li> <li>Historical Essay on the Revolution (I. Philimonos) – 1859</li> <li>Histories of the Greek Palingenesis (M. Economou) – 1873</li> <li>History of Attila and his Successors (T.Amedee) – Eleftheroudakis – 1903</li> <li>Capodistria Letters (DavidFreming) – 1841</li> <li>Charilaos Trikoupis (G. Tsokopoulos) – Fexis – 1896</li> </ul>
el: Κατάλογος μερικών από τις σπάνιες εκδόσεις που διαθέτει η Βιβλιοθήκη του Συλλόγου ΣΚΟΥΦΑΣ: <ul> <li>Ιστορία του Μακεδονικού Ελληνισμού – Δρόϋσεν – 1899</li> <li>Άπαντα Σολωμού – Σακελλαρίου – 1901</li> <li>Άπαντα Λουκιανού – Φέξη – 1911</li> <li>Διαλέξεις Ελλήνων Ποιητών – Εστία – 1925</li> <li>Νομικά Φιλοσοφήματα – Η. Αναστασιάδου – 1927</li> <li>Ηπειρωτικόν Γλωσσάριον (Αραβαντινού) – Πετράκου – 1909</li> <li>Ανατολική Θράκη – Νετρ Βέη – 1927</li> <li>Γάμος εν Κρήτη (Παύλου Βλαστού) – 1893</li> <li>Η Αγία Πόλις Ιερουσαλήμ (Βενιαμίν Ιωαννίδου) – 1877</li> <li>Βιογραφικαί Σημειώσεις (Κλαυδίου Μπανταλούκα) – 1876</li> <li>Γενική Εισαγωγή εις την Χριστιανικήν Αρχαιολογίαν (Γ. Λαμπάκη) – 1897</li> <li>Περί Αμφιβολίας –SherwoodEddy– 1920</li> <li>Στοχασμοί για το Δημοτικό Τραγούδι (Άλκη Θρύλου) – Καλλέργη – 1928</li> <li>Ενοχικόν Δίκαιον (E.Dernburg) – Φέξη – 1909</li> <li>Ψυχολογία (Δημ. Μωραΐτου) – 1926</li> <li>Εγχειρίδιον Εμπειρικής Ψυχολογίας (Γουστ. Αδ. Λίνδερ) – Κορίννης – 1884</li> <li>Η Εποχή της Αναγεννήσεως (W.Pater) – Βασιλείου – 1923</li> <li>Το δράμα των Λεύκτρων (Θεοχ. Τσούτσινος) – Χατζηιωάννου – 1924</li> <li>Ο Πρωτομάστορας (Καλομοίρη) – Παναθηναίων – 1910</li> <li>Βιογραφία Ηρώων: Μ. Μπότσαρης-Γ. Καραϊσκάκης (Γεώργιος Γαζής) – 1828</li> <li>Μάξιμος ο Γραικός – Παπαμιχαήλ – 1920</li> <li>Ιγνάτιος Μητροπολίτης Ουγγροβλαχίας (1766-1828) – Πρωτοψάλτης – 1919</li> <li>Το εν Ηπείρω Αγροτικόν Ζήτημα (Γεωργίου Παχύ) – 1882</li> <li>Τουρκοκρατούμενη Ελλάς – Σάθας – 1869</li> <li>Ιστορικαί Διατριβαί – Σάθας – 1870</li> <li>Φιλική Εταιρεία (Ι. Φιλήμονος) – Κολτούρα – 1834</li> <li>Δοκίμιον Ιστορικόν Περί της Επαναστάσεως (Ι. Φιλήμονος) – 1859</li> <li>Ιστορικά της Ελληνικής Παλιγγενεσίας (Μ. Οικονόμου) – 1873</li> <li>Ιστορία του Αττίλα και των διαδόχων του (T.Amedee) – Ελευθερουδάκης – 1903</li> <li>Επιστολαί Καποδίστρια (David Freming) – 1841</li> <li>Χαρίλαος Τρικούπης (Γ. Τσοκόπουλος) – Φέξης – 1896</li> </ul>

source: Rare Manuscripts: <ul> <li>Protocols of Swearing of the Citizens of Arta as Greek Citizens in 1881</li> <li>Arta in the archives of Venice (K.D. Mertzios)</li> <li>Handwritten originals with documents on the Turkish occupation</li> <li>Manuscript documents from the Karapanos archive</li> <li>Manuscripts of Ecclesiastical Content</li> <li>Manuscript (about 250 years old) with texts of ancient and ecclesiastical authors</li> <li>Archives of the Russian Consulate in Arta – Preveza from 1858 – 1881</li> </ul>
el: Σπάνια χειρόγραφα: <ul> <li>Πρωτόκολλα Ορκωμοσίας των Αρτινών ως Ελλήνων Πολιτών το 1881</li> <li>Η Άρτα εις τα αρχεία της Βενετίας (Κ.Δ. Μέρτζιος)</li> <li>Χειρόγραφα πρωτότυπα με έγγραφα επί Τουρκοκρατίας</li> <li>Έγγραφα χειρόγραφα από το αρχείο Καραπάνου</li> <li>Χειρόγραφα Εκκλησιαστικού Περιεχομένου</li> <li>Χειρόγραφο (250 ετών περίπου) με κείμενα αρχαίων και εκκλησιαστικών συγγραφέων</li> <li>Αρχεία Ρωσικού Υποπροξενείου Άρτης – Πρεβέζης περιόδων 1858 – 1881</li> </ul>

source: Publications of the SKOUFAS Association: <ul> <li>Essay on Arta and Preveza by Seraphim Xenopoulos</li> <li>Pyrrhus the King of Epirus by Petros Garoufalias</li> <li>Olympia of Petros Garoufalia</li> <li>Ambrakia of Chrysiida Tzouvara – Souli</li> <li>Museological meditations – Eurydice Anjoulatou – Retsila</li> <li>Education as a value - Eurydiki Anjoulatou - Retsila</li> <li>"Skoufas" magazine</li> <li>About the Despotate of Epirus - Ioannis Romanos</li> <li>The Arta of war and occupation - Con/nos Vayas</li> <li>Thomas I Angelos Komnenos Doukas - Kon/nos Tsiligiannis</li> <li>Proceedings of "Despotate of Epirus"</li> <li>Proceedings "Byzantine Arta and its region"</li> <li>Texts and memories from the tragic December 1944 – Dim. Garufalias</li> <li>The passage of time – Arts and professions in Arta of yesterday – Yiannis Koutsoumbas</li> </ul>
el: Εκδόσεις του Συλλόγου ΣΚΟΥΦΑΣ: <ul> <li>Δοκίμιον περί Άρτης και Πρεβέζης του Σεραφείμ Ξενοπούλου</li> <li>Πύρρος ο Βασιλιάς της Ηπείρου του Πέτρου Γαρουφαλιά</li> <li>Ολύμπιας του Πέτρου Γαρουφαλιά</li> <li>Αμβρακία της Χρυσηίδας Τζουβάρα – Σούλη</li> <li>Μουσειολογικοί διαλογισμοί – Ευρυδίκη Αντζουλάτου – Ρετσίλα</li> <li>Η παιδεία ως αξία – Ευρυδίκη Αντζουλάτου – Ρετσίλα</li> <li>Περιοδικό «Σκουφάς»</li> <li>Περί του Δεσποτάτου της Ηπείρου – Ιωάννου Ρωμανού</li> <li>Η Άρτα του πολέμου και της κατοχής – Κων/νος Βάγιας</li> <li>Θωμάς Α’ Άγγελος Κομνηνός Δούκας – Κων/νος Τσιλιγιάννης</li> <li>Πρακτικά «Δεσποτάτου της Ηπείρου»</li> <li>Πρακτικά «Η Βυζαντινή Άρτα και η περιοχή της»</li> <li>Κείμενα και αναμνήσεις από τον τραγικό Δεκέμβριο 1944 – Δημ. Γαρουφαλιάς</li> <li>Στου χρόνου τα γυρίσματα – Τέχνες και επαγγέλματα στην Άρτα του χτες του – Γιάννη Κουτσούμπα</li> </ul>

source: Find Us
el: Βρείτε μας

source: Contact Info
el: Στοιχεία επικοινωνίας

source: Skoufas Library
el: Βιβλιοθήκη Σκουφά

source: All Book Entries
el: Κάρτες Βιβλίου

source: View all books in the catalogue
el: Όλα τα βιβλία στον κατάλογο.

source: Book Entries by Author
el: Κάρτες Βιβλίου κατα Συγγραφέα

source: View all books in the catalogue, ordered by author.
el: Όλα τα βιβλία στον κατάλογο, κατα συγγραφέα.

source: Book Entries by Dewey
el: Κάρτες Βιβλίου κατα Dewey

source: View all books in the catalogue, ordered by Dewey code.
el: Όλα τα βιβλία στον κατάλογο, κατα Dewey.

source: Calculated Fields
el: Πεδία

source: Reports showing values for fields.
el: Τιμές για καθε πεδίο (για έλεγχο).

source: Reports
el: Αναφορές

source: Reports used to find issues in data.
el: Προς έυρεση λαθών στα δεδομένα.

source: People that have donated books.
el: Που έχουν προσφέρει βιβλία στον κατάλογο.

source: Home
el: Αρχική

source: About
el: Περί

source: Contact
el: Επικοινωνία

source: Search
el: Αναζήτηση

source: Skoufas Association
el: Μουσικοφιλολογικός Σύλλογος Σκουφάς

source: Design - Construction: Claudio Bantaloukas
el: Σχεδιασμός - Τεχνική κατασκευή: Κλαύδιος Μπανταλούκας

source: Invalid ISBN: Not a string
el: Λανθασμένο ISBN: λάθος τύπος

source: Invalid ISBN: wrong checksum
el: Λανθασμένο ISBN: λάθος στο τελευταίο ψηφίο

source: Invalid ISBN: component not one of 978, 979
el: Λανθασμένο ISBN: δεν αρχιζει με 978, 979

source: Invalid ISBN: length not 10 or 13
el: Λανθασμένο ISBN: χρειάζονται 10 ή 13 ψηφία

source: Invalid ISBN
el: Λανθασμένο ISBN

source: Invalid ISBN: Only upper case allowed
el: Λανθασμένο ISBN: επιτρέπονται μόνο κεφαλαία

source: Invalid ISSN: Not a string
el: Λανθασμένο ISSN: λάθος τύπος

source: Invalid ISSN: wrong checksum
el: Λανθασμένο ISSN: λάθος στο τελευταίο ψηφίο

source: Invalid ISSN: length not 8
el: Λανθασμένο ISSN: χρειάζονται 8 ψηφία

source: Invalid ISSN
el: Λανθασμένο ISSN

source: Invalid ISSN: Only upper case allowed
el: Λανθασμένο ISSN: επιτρέπονται μόνο κεφαλαία

source: Invalid EAN: Not a string
el: Λανθασμένο EAN: λάθος τύπος

source: Invalid EAN: wrong checksum
el: Λανθασμένο EAN: λάθος στο τελευταίο ψηφίο

source: Invalid EAN: length not one of 14, 13, 12, 8
el: Λανθασμένο EAN: χρειάζονται 14 ή 13 ή 12 ή 8 ψηφία

source: Invalid EAN
el: Λανθασμένο EAN

source: Invalid EAN: Only upper case allowed
el: Λανθασμένο EAN: επιτρέπονται μόνο κεφαλαία

source: Invalid Dewey: Not a string
el: Λανθασμένο Dewey: λάθος τύπος

source: Invalid Dewey: Only upper case allowed
el: Λανθασμένο Dewey: επιτρέπονται μόνο κεφαλαία

source: Invalid Dewey: Invalid format
el: Λανθασμένο Dewey: επιτρέπονται μόνο αριθμοί στην αρχή, μια τελεία μετα το τρίτο ψηφίο και μονο κεφαλαία μετα απο ενα κενό
