Repository: skoufas/skoufas-library
Catalog: loaning/locale/*/LC_MESSAGES/django.po
Languages: el

source: loaning
el: Δανεισμός

source: first name
el: Όνομα

source: middle name
el: Μεσαίο όνομα

source: surname
el: Επίθετο

source: id number
el: Αρ. Ταυτοποίησης

source: id type
el: Είδος ταυτότητας

source: phone number
el: Αρ. Τηλεφώνου

source: address
el: Διεύθηνση

source: Customer
el: Δανειζόμενος

source: Customers
el: Δανειζόμενοι

source: customer
el: Δανειζόμενος

source: Entry number
el: Αριθμός Εισαγωγής

source: start
el: Έναρξη

source: expected end
el: Επιστροφή έως

source: end
el: Επιστροφή

source: note
el: Σημειώσεις

source: No customer
el: Άγνωστος Δανειζόμενος

source: No end
el: Δεν έχει επιστραφεί

source: Loan
el: Δανεισμός

source: Loans
el: Δανεισμοί
